---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.LiningThickness
source: html/42d5826c-1d36-d468-0fba-65e4b5c9a661.htm
---
# Autodesk.Revit.DB.FabricationPart.LiningThickness Property

The lining thickness of the fabrication part. If the fabrication part is not lined, returns zero.

## Syntax (C#)
```csharp
public double LiningThickness { get; }
```